In [13]:
import pandas as pd
import numpy as np

In [14]:
df = pd.read_csv("stud.csv")

In [16]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [23]:
# Select the first 10 rows of the dataset.
df[:9]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67

In [27]:
# Display only gender, math score, and reading score columns for the first 15 rows.
df.loc[:,["math score","gender","reading score"]]

     math score  gender  reading score
0            72  female             72
1            69  female             90
2            90  female             95
3            47    male             57
4            76    male             78
..          ...     ...            ...
995          88  female             99
996          62    male             55
997          59  female             71
998          68  female             78
999          77  female             86

[1000 rows x 3 columns]

In [31]:
# Retrieve the last 5 rows using iloc.
df[-5:]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [33]:
# Display every alternate row from the dataset using slicing.
df[::2]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
6,female,group B,some college,standard,completed,88,95,92
8,male,group D,high school,free/reduced,completed,64,64,67
...,...,...,...,...,...,...,...,...
990,male,group E,high school,free/reduced,completed,86,81,75
992,female,group D,associate's degree,free/reduced,none,55,76,76
994,male,group A,high school,standard,none,63,63,62
996,male,group C,high school,free/reduced,none,62,55,55
998,female,group D,some college,standard,completed,68,78,77

In [35]:
# Get all students who scored above 85 in math.
df.loc[df["math score"] > 85]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
2,female,group B,master's degree,standard,none,90,95,93
6,female,group B,some college,standard,completed,88,95,92
16,male,group C,high school,standard,none,88,89,86
34,male,group E,some college,standard,none,97,87,82
53,male,group D,high school,standard,none,88,78,75
...,...,...,...,...,...,...,...,...
962,female,group E,associate's degree,standard,none,100,100,100
970,female,group D,bachelor's degree,standard,none,89,100,100
979,female,group C,associate's degree,standard,none,91,95,94
990,male,group E,high school,free/reduced,completed,86,81,75
995,female,group E,master's degree,standard,completed,88,99,95

In [37]:
# Select students where gender is "female" and reading score is above 80.
df.loc[(df["gender"] == "female") | (df["reading score"] > 80)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [39]:
# Retrieve all students who completed the test preparation course.
df.loc[df["test preparation course"] == "completed"]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,female,group C,some college,standard,completed,69,90,88
6,female,group B,some college,standard,completed,88,95,92
8,male,group D,high school,free/reduced,completed,64,64,67
13,male,group A,some college,standard,completed,78,72,70
18,male,group C,master's degree,free/reduced,completed,46,42,46
...,...,...,...,...,...,...,...,...
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77

In [42]:
# Filter students who have "free/reduced" lunch and scored less than 60 in writing.
df.loc[(df["lunch"] == "free/reduced") & (df["writing score"] < 60) ]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
7,male,group B,some college,free/reduced,none,40,43,39
9,female,group B,high school,free/reduced,none,38,60,50
17,female,group B,some high school,free/reduced,none,18,32,28
18,male,group C,master's degree,free/reduced,completed,46,42,46
...,...,...,...,...,...,...,...,...
948,male,group B,some high school,free/reduced,completed,49,50,52
961,female,group D,some high school,free/reduced,none,48,54,53
980,female,group B,high school,free/reduced,none,8,24,23
988,female,group A,some high school,free/reduced,none,44,45,45
996,male,group C,high school,free/reduced,none,62,55,55

In [47]:
# Extract only math score and writing score columns using loc.
df.loc[:,["math score"]]
df.iloc[:,[5]]

     math score
0            72
1            69
2            90
3            47
4            76
..          ...
995          88
996          62
997          59
998          68
999          77

[1000 rows x 1 columns]

In [51]:
# Select rows 50 to 60 and columns gender, lunch, and math score together.
df.loc[50:59,["gender","lunch","math score"]]
df.iloc[50:59,[0,3,5]]

    gender         lunch  math score
50    male      standard          53
51    male  free/reduced          77
52    male      standard          53
53    male      standard          88
54  female  free/reduced          71
55  female  free/reduced          33
56  female      standard          82
57    male      standard          52
58    male      standard          58

In [58]:
# Find students with math score between 70 and 90 (inclusive).
df.loc[df["math score"].between(70,90,inclusive='both')]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
...,...,...,...,...,...,...,...,...
984,female,group C,some high school,standard,none,74,75,82
987,male,group E,some high school,standard,completed,81,75,76
990,male,group E,high school,free/reduced,completed,86,81,75
995,female,group E,master's degree,standard,completed,88,99,95
999,female,group D,some college,free/reduced,none,77,86,86

In [60]:
# Select students who belong to group A or group B and scored above 75 in reading.
df.loc[(df["race/ethnicity"].isin(["group A","group B"])) & (df["reading score"] > 75)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
12,female,group B,high school,standard,none,65,81,73
77,male,group A,bachelor's degree,standard,completed,80,78,81
...,...,...,...,...,...,...,...,...
946,male,group B,high school,standard,none,82,82,80
969,female,group B,bachelor's degree,standard,none,75,84,80
982,male,group B,some high school,standard,completed,79,85,86
983,female,group A,some college,standard,completed,78,87,91
991,female,group B,some high school,standard,completed,65,82,78

In [62]:
# Display only male students who didnâ€™t complete the test preparation course.
df.loc[(df["gender"] == 'male') & (df["test preparation course"] == "none")]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
10,male,group C,associate's degree,standard,none,58,54,52
11,male,group D,associate's degree,standard,none,40,52,43
...,...,...,...,...,...,...,...,...
977,male,group C,associate's degree,standard,none,62,65,58
981,male,group D,some high school,standard,none,81,78,78
985,male,group A,high school,standard,none,57,51,54
994,male,group A,high school,standard,none,63,63,62
996,male,group C,high school,free/reduced,none,62,55,55

In [85]:
# Select top 10 rows and reverse them using indexing.
df.head(10).iloc[::-1]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
9,female,group B,high school,free/reduced,none,38,60,50
8,male,group D,high school,free/reduced,completed,64,64,67
7,male,group B,some college,free/reduced,none,40,43,39
6,female,group B,some college,standard,completed,88,95,92
5,female,group B,associate's degree,standard,none,71,83,78
4,male,group C,some college,standard,none,76,78,75
3,male,group A,associate's degree,free/reduced,none,47,57,44
2,female,group B,master's degree,standard,none,90,95,93
1,female,group C,some college,standard,completed,69,90,88
0,female,group B,bachelor's degree,standard,none,72,72,74

In [94]:
# Retrieve the rows for students whose parents have a master's degree and scores in all subjects are above 80.
score_columns = ["math score", "reading score", "writing score"]
above_80 = df[score_columns].gt(80).all(axis=1)
df.loc[(df['parental level of education'] == "master's degree") & (above_80)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
2,female,group B,master's degree,standard,none,90,95,93
106,female,group D,master's degree,standard,none,87,100,100
130,male,group D,master's degree,standard,none,89,84,82
164,female,group E,master's degree,standard,none,81,92,91
175,female,group C,master's degree,standard,completed,81,91,87
377,female,group D,master's degree,free/reduced,completed,85,95,100
604,male,group D,master's degree,free/reduced,completed,84,89,90
618,male,group D,master's degree,standard,none,95,81,84
685,female,group E,master's degree,standard,completed,94,99,100
713,male,group D,master's degree,standard,none,81,81,84
845,male,group E,master's degree,standard,none,90,85,84
846,male,group C,master's degree,standard,completed,91,85,85
861,female,group E,master's degree,free/reduced,none,81,86,87
900,male,group D,master's degree,standard,none,85,84,89
957,female,group D,master's degree,standard,none,92,100,100
995,female,group E,master's degree,standard,completed,88,99,95